<h1 style="color:green" align="center"> 
    Linear Regression Multiple Variables</h1>

<h2 style="color:purple" align="center" >Sample hiring data  </h2>

<h3>This file contains hiring statics for a firm such as experience of candidate, his written test score and personal interview score. Based on these 3 factors, HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide salaries for future candidates.<br><br>
Using this predict salaries for following candidates 
<li> 2 yr experience, 9 test score, 6 interview score</li>
<li> 12 yr experience, 10 test score, 10 interview score</li>
</h3>

In [225]:
#Importing the dependencies 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from word2number import w2n

In [226]:
#Reading the csv file
df = pd.read_csv("hiring.csv") 
df.info

<bound method DataFrame.info of   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000>

In [227]:
#Renaming the column
df.rename(columns = {'salary($)':'salary'}, inplace = True)

In [228]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary
0        NaN                    8.0                           9   50000
1        NaN                    8.0                           6   45000
2       five                    6.0                           7   60000
3        two                   10.0                          10   65000
4      seven                    9.0                           6   70000
5      three                    7.0                          10   62000
6        ten                    NaN                           7   72000
7     eleven                    7.0                           8   80000

In [229]:
#Filling the missing values
df["experience"].fillna("Zero", inplace = True)

In [230]:
#Converting the words into number 
df.experience = df.experience.apply(w2n.word_to_num)

In [231]:
df = df.fillna(df.mean())

In [232]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary
0           0               8.000000                           9   50000
1           0               8.000000                           6   45000
2           5               6.000000                           7   60000
3           2              10.000000                          10   65000
4           7               9.000000                           6   70000
5           3               7.000000                          10   62000
6          10               7.857143                           7   72000
7          11               7.000000                           8   80000

In [233]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()
regressor.fit(df.drop('salary',axis='columns'),df.salary)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [234]:
my_pred1 = (regressor.predict([[2, 9, 6]]))
print(float(my_pred1))

53290.892559447646

In [235]:
my_pred2 = regressor.predict([[12, 10, 10]])
print(float(my_pred2))

92268.07227783566

In [237]:
accuracy = regressor.score(df.drop('salary',axis='columns'),df.salary)
print(accuracy*100,"%")

96.39958361860577 %